openfoam_cases/3D_rect_tube_T_FLAME_ethanol/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.0  -0.01 -0.01)
    (0.05 -0.01 -0.01)
    (0.05  0.01 -0.01)
    (0.0   0.01 -0.01)
    (0.0  -0.01  0.01)
    (0.05 -0.01  0.01)
    (0.05  0.01  0.01)
    (0.0   0.01  0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 30 30) simpleGrading (1 1 1) // (170 50 50) +- ok, (170 80 80) - :D
);

edges
(
);

boundary
(
    out
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    in
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    border
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
            (0 1 5 4)
            (7 6 2 3)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
