openfoam_cases/3D_rect_tube_T_FLAME_ethanol/0.orig/CH4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.3;

boundaryField
{
    in
    {
        type            fixedValue;
        value           uniform 0.3;
    }
    out
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }
    border
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
